app/controllers/charades_controller.rb

SELECT * FROM `charades`
---
  def index
    @charades = Charade.all

SELECT * FROM `charades` WHERE (`charades`.`id` = 1)
---
  def show
    @charade = Charade.find(params[:id])

SELECT * FROM `charades` WHERE (`charades`.`id` = 1)
---
  def edit
    @charade = Charade.find(params[:id])

INSERT INTO `charades` (`name`, `created_at`, `updated_at`, `question`, `answer`) VALUES('O desafio do poço', '2009-04-03 18:49:08', '2009-04-03 18:49:08', 'O que pe um poço?', 'é uma meleca')
---
  def create
    @charade = Charade.new(params[:charade])

    respond_to do |format|
      if @charade.save

SELECT * FROM `charades` WHERE (`charades`.`id` = 1)
UPDATE `charades` SET `updated_at` = '2009-04-04 14:00:33', `answer` = 'marido da poça', `question` = 'O que é um poço?' WHERE `id` = 1
---
  def update
    @charade = Charade.find(params[:id])

    respond_to do |format|
      if @charade.update_attributes(params[:charade])