app/controllers/halls_controller.rb

  def index
    @halls = Hall.all
---
SELECT * FROM `halls`

  def show
    @hall = Hall.find(params[:id])
---
SELECT * FROM `halls` WHERE (`halls`.`id` = 1)

  def edit
    @hall = Hall.find(params[:id])
---
SELECT * FROM `halls` WHERE (`halls`.`id` = 1)

  def create
    @hall = Hall.new(params[:hall])

    respond_to do |format|
      if @hall.save
---
INSERT INTO `halls` (`created_at`, `updated_at`, `date`, `user_id`, `charade_id`) VALUES('2009-04-03 19:35:32', '2009-04-03 19:35:32', '2009-04-03 19:35:00', 1, 1)

  def update
    @hall = Hall.find(params[:id])

    respond_to do |format|
      if @hall.update_attributes(params[:hall])
---
SELECT * FROM `halls` WHERE (`halls`.`id` = 1)
UPDATE `halls` SET `updated_at` = '2009-04-03 20:38:10', `date` = '2009-04-03 00:00:00' WHERE `id` = 1