app/controllers/sessions_controller.rb

SELECT * FROM `halls` WHERE (`halls`.`date` = '2009-04-05 00:00:00') LIMIT 1
---
  def new
    @hall = Hall.find_by_date(Time.today)