app/controllers/users_controller.rb

  def new
    @hall = Hall.find_by_date(Time.today)
---
SELECT * FROM `halls` WHERE (`halls`.`date` = '2009-04-05 00:00:00') LIMIT 1

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `hits`, `salt`, `total_attempts`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `admin`, `remember_token`, `attempts`, `login`, `email`) VALUES('Davi Paulo Simão Ruiz', 0, 'eee321f8755b2d723eaaf3cc4b665732a95743b9', 0, '2009-04-04 18:01:53', 'e626a697895111a55753674b385534e454b795f0', NULL, '2009-04-04 18:01:53', 0, NULL, 0, 'davi.ruiz', 'davi.psr@gmail.com')