app/controllers/welcome_controller.rb

SELECT * FROM `halls` WHERE (`halls`.`date` = '2009-04-03 17:35:36') LIMIT 1
SELECT * FROM `halls` LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `winners` ON `users`.id = `winners`.user_id WHERE ((`winners`.hall_id = 1))
SELECT * FROM `winners` WHERE (`winners`.`user_id` = 1) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    @hall = Hall.find_by_date(Time.today)
    @hall.users.each do |user|
      winner = Winner.find_by_user_id(user.id)
      user.attempts = winner.attempts
    end
    @user = User.find(session[:user_id])