app/controllers/winner_controller.rb

  def create
    hall = Hall.find_by_date(Time.today)
    user = User.find(session[:user_id])
    if hall.charade.answer == params[:answer]
      @winner = Winner.new
      @winner.hall_id = hall.id
      @winner.user_id = session[:user_id]
      user.hits += 1
      @winner.attempts = user.get_attempts
      if @winner.save
        flash.now[:notice] = "Parabéns! Você está na lista dos vencedores!"
      end
    else
      user.attempts += 1
      flash[:notice] = "Ops, " + user.attempts.to_s + "ª tentativa incorreta! Tente Novamente!"
    end
    user.save
---
SELECT * FROM `halls` WHERE (`halls`.`date` = '2009-04-04 00:00:00') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `winners` (`created_at`, `updated_at`, `hall_id`, `user_id`, `attempts`) VALUES('2009-04-04 18:16:17', '2009-04-04 18:16:17', 1, 1, 3)
UPDATE `users` SET `updated_at` = '2009-04-04 18:16:17', `total_attempts` = 3, `hits` = 1, `attempts` = 0 WHERE `id` = 1